Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Incremental compliance In this example, the compliance team identifies all open source included in the software baseline (here called v 1.0), and drives all of the open source components through the compliance end-to-end process.
ja: インクリメンタル コンプライアンス この例では、コンプライアンス チームは、ソフトウェア ベースライン（ここでは仮にV 1.0と呼びます）に含まれる全てのオープン ソースを特定し、オープン ソース コンポーネント全てが、コンプライアンス プロセス全体を通るようにします。

source: Incremental compliance is the process by which compliance is maintained when product features are added to a baseline version that has already completed initial compliance.
ja: インクリメンタル コンプライアンスは、すでに初期コンプライアンスが完了しているベースライン版に製品フィーチャーを追加する時に、コンプライアンスを維持するために実施されるプロセスです。

source: Indicate how to access the code of the open source package (written offer) either through a web page download or by contacting your company via email or postal mail at a specified address provided in the product manual.
ja: オープン ソース パッケージのコードへのアクセス方法（書面による申し出）、ウェブページからのダウンロードや、製品マニュアルで提供される特定のアドレス宛てのemailや郵便による問い合わせなどを提示します。

source: Individuals and teams involved in ensuring open source compliance
ja: オープンソース コンプライアンスを確かなものとする個人とチーム

source: Inform
ja: 通知

source: Inform 123
ja: 通知 123

source: Inform end users how to obtain a copy of the open source code (when applicable, for example in the case of GPL and LGPL licensed source code).
ja: （例えば、GPL, LGPLで許諾されたソース コードのように、適用可能な場合には）エンド ユーザーにオープン ソース コードのコピーの入手方法を伝えます。

source: Inform inquirers about your compliance program and practices, and assure them that you will investigate their question.
ja: 照会者に自社のコンプライアンス手続きとプラクティスを伝え、照会された事項を調査することを確約します。

source: Inform the end user how to obtain a copy of the source code that’s been made available as a result of meeting the license obligations (when applicable)
ja: エンド ユーザーに、ライセンス義務を満たした結果として入手可能になっているソース コードのコピーをどのおうに入手できるかを通知します（必要に応じて）

source: Inform the end user how to obtain a copy of the source code that’s been made available as a result of meeting the license obligations (when applicable) .
ja: エンド ユーザーに、ライセンス義務を満たした結果として入手可能になっているソース コードのコピーをどのおうに入手できるかを通知します（必要に応じて）

source: Informal Training
ja: 非公式トレーニング

source: Informal Training 127
ja: 非公式トレーニング 127

source: Informal methods include webinars, brown bag seminars, and presentations to new hires as part of the new employee orientation session.
ja: 非公式の方法は、ウェブでのトレーニング、ブラウン バッグ セミナー、新規雇用従業員へのオリエンテーションの一部としての説明などを含みます。

source: Informal training channels may include any or all of the following:
ja: 非公式のトレーニングは下記のいずれか、あるいは全部を含みます。

source: Information Technology (IT)
ja: IT (情報技術)

source: Information Technology (IT) Provide support and maintenance for the tools and automation infrastructure used by the compliance program
ja: IT (情報技術) コンプライアンスプログラムで利用されるツールと自動化のインフラをサポートし整備

source: Information on Obtaining the Source Code
ja: ソース コード入手についての情報

source: Information requested as part of the OSRB usage form
ja: OSRB利用フォームの一部として要求される情報

source: Input
ja: インプット

source: Inputs and outputs of the usage process
ja: 利用プロセスのインプットとアウトプット

source: Inquiry Response Strategy
ja: 照会応答戦略

source: Inquiry Response Strategy 32
ja: 照会応答戦略 32

source: Inserting open source code into proprietary or 3rd party code
ja: オープンソースのコードをサードパーティのコードに挿入

source: Inspect all open source components entering the organization source code repository that do not correspond to an incoming request to use open source: Relying on engineers to fill out forms announcing their intent to use open source is not always a reliable method to account for all incoming open source software.
ja: 組織のソース コード リポジトリに入る、オープン ソースの利用要求に対応していない全オープン ソース コンポーネントの検査：オープン ソース利用の意図のフォームへの記載を技術者に頼るのは、全ての入るオープン ソース ソフトウェアを説明するには必ずしも確実な方法とはいえません。

source: Inspect and resolve each file or snippet flagged by the scanning tool; matching source code may come from sources that surprise you.
ja: スキャン ツールでフラグを付けられた各ファイルやコード断片を精査し、解決します。驚くような由来のソース コードと一致することがあります。

source: Instant Compliance Method
ja: 即時コンプライアンス方法

source: Institutionalization and Sustainability
ja: 内面化と末永い実行

source: Institutionalization and Sustainability 43
ja: 内面化と末永い実行 43

source: Integrate compliance milestones as part of the development process: This exercise takes place in collaboration with the OSRB and the Compliance Officer.
ja: コンプライアンス上のマイルストーンを開発プロセスの一部に統合：これはOSRBとコンプライアンス オフィサーと協力して行います。

source: Integrate compliance practices in dev process
ja: コンプライアンスの実践を開発プロセスの中に統合

source: Intellectual Property Failures
ja: 知的財産権上の失敗

source: Intellectual Property Failures 22
ja: 知的財産権上の失敗 22

source: Inter-component dependencies beyond APIs (s/w buses, IPCs, web APIs, etc.)
ja: APIを超えたコンポーネント間依存関係(s/w buses, IPCs, web APIs, etc.).

source: Inter-component dependencies beyond APIs (s/w buses, IPCs, web APIs, etc.) .
ja: APIを超えたコンポーネント間依存関係(s/w buses, IPCs, web APIs, etc.).

source: Inter-language bindings
ja: 言語間の結合

source: Interaction methods between various software components (proprietary, third-party, open source)
ja: 様々なソフトウェア コンポーネント間（プロプライエタリ、サード パーティ、オープン ソース）の相互作用法

source: Interaction methods between various software components (proprietary, third-party, open source) .
ja: 様々なソフトウェア コンポーネント間（プロプライエタリ、サード パーティ、オープン ソース）の相互作用法

source: Internal (tools, IT, etc.)
ja: 内部利用（ツール、IT等）

source: Internal Communication
ja: 内部的な対話

source: Internal communications can take any of several forms:
ja: 内部的な対話は下記のいずれでも可能です。

source: Internal package owner (the developer working on specific source code component)
ja: 社内パッケージ所有者（特定のソース コード コンポーネントの開発者）

source: Internal package owner (the developer working on specific source code component) .
ja: 社内パッケージ所有者（特定のソース コード コンポーネントの開発者）

source: Investigate
ja: 調査

source: Investigate 123
ja: 調査 123

source: Issue a ticket to the documentation team to update end user notices in the product documentation, to reflect that open source is being used in the product or service.
ja: 製品に付属する文書中のエンド ユーザーへの通知を更新して、製品やサービスにオープン ソースが使用されていることを反映させるため、文書チームへチケットが発行されます。

source: It accelerates providing solutions to discovered problems within acceptable timeframes without posing a serious threat to the delivery timeline.
ja: それは、出荷スケジュールへ深刻な問題を与えないような許容できる期間で、発見された問題へ解決をもたらすことを促進します。

source: It aids in the discovery of compliance issue very early in the process.
ja: それは、プロセスの早い段階でのコンプライアンス課題の発見を助けます。

source: It also serves as a way to publicize and promote an organization’s compliance policies and processes, and to promote a culture of compliance.
ja: また、組織のコンプライアンス ポリシーやプロセスを広めて推進し、コンプライアンス文化を促進する手段でもあります。

source: It emerges at an important time, as the industry strives to be leaner, more efficient, and more digital.
ja: 業界が、もっと積極的に、もっと効率的に、もっとディジタル化を促進しようと努力している、そういう重要な時期に現れています。

source: It improves the efficiency of processing incremental, scans since it reduces the delta of source code that needs to be scanned from previous source code scans.
ja: それは前に実行したソース コード スキャンの中でスキャンが必要なソース コード差分を減らすので、インクリメンタル スキャンの実行効率を改善します。

source: It includes a formal process for the approval, acquisition, and use of open source, and a method for releasing software that contains open source or that’s licensed under an open source license.
ja: オープンソースの承認、取得 , 利用、オープンソースライセンスを含むかオープンソース ラインセンスに基づいてライセンスされたソフトウェアをリリースする方法、の正式なプロセスも本戦略に含まれます。

source: It includes all information about the open source component in question, in addition to the location of the source code in the source code repository system.
ja: フォームは、ソース コード リポジトリ システムの中でのソース コードの位置も含めて、問題となっているオープン ソース コンポーネントに関する全ての情報を含んでいます。

source: It includes:
ja: 以下を含みます。

source: It includes: .
ja: 以下を含みます。

source: It is also advisable to send updates of your internal investigation as they become available.
ja: 提示可能になったところで、内部調査に関する最新情報を伝えることは良いことです。

source: It is divided into three parts:
ja: 3つの部分に分かれます。

source: It is highly recommended that you examine software supplied to you by third-party software providers.
ja: サードパーティから供給されたソフトウェアは自分で検査するようにすることが強く望まれます。

source: It is highly recommended to re-scan the source code after Engineering has resolved the issue, to confirm removal of the problem source code and its replacement with appropriate and compatible code.
ja: 技術担当が課題を解決した後、問題のソース コードが削除され、適切で同等のコードによって置き換えられていることを確認するために、ソース コードを再スキャンすることを推奨します。

source: It is highly recommended to seek legal support from your Counsel on this topic.
ja: このトピックに関して、法務担当からのサポートを受けることを強く勧めます。

source: It is important to acknowledge that compliance is not just a legal- department exercise.
ja: コンプライアンスは法務部門の業務に留まるものではない、と認識することは重要です。

source: It is important to acknowledge that compliance is not just a legal-department exercise.
ja: コンプライアンスは法務部門の業務に留まるものではない、と認識することは重要です。

source: It is important to have executive-level commitment to the open source management program to ensure success and continuity.
ja: 役員レベルでのオープンソース管理プログラムへのコミットは、その成功と継続のために重要です。

source: It is important to understand the inquirer’s identity and motive and to verify whether the complaint is justifiable, accurate, and current.
ja: 照会者の身元と動機を理解し、主張が正当で正確なものでその時点で意味のあるものかを確認するのは重要です。

source: It is not a general approval of the open source component for all use cases in all products.
ja: それは、全製品の全ユースケースに対するそのオープン ソース コンポーネントの全般的な承認ではありません。

source: It is not acceptable to point “upstream” to a supplier and to inform recipients of your code that meeting license obligations was the responsibility of the supplier instead of your own.
ja: 受け入れた後はオープンソースを含む製品やサービスを配送する業者として義務は自社のものとなるからです。自社のコードの受け手に対し、自社の「上流」の供給元を名指しし、ライセンス上の義務を果たす責任は供給元であり自社ではない、ということは受け入れられません。

source: It is often the case when compiling packages on a company-configured machine that environment and compiler settings are all preconfigured and set.
ja: 企業で初期設定したマシン上でパッケージをコンパイルする時に、環境やコンパイラが全て事前に構成されたり設定されているということがよくあります。

source: It is recommended to identify all the incoming software components and run them through the compliance process.
ja: 入るソフトウェア コンポーネントは、全て特定され、コンプライアンス プロセスを通されることが推奨されます。

source: It is recommended to maintain an open a dialog with inquirers.
ja: 照会者との率直な対話を維持することが推奨されます。

source: It is strongly recommended to publish an internal-only set of guidelines in plain, non-legalistic language that establishes basic rules for modifying existing source code.
ja: 既存のソース コードを変更する基本ルールを確立するために、平易で法務用語を使わない言葉で表現した、内部利用目的のガイドラインを発行することを強く勧めます。

source: It is usually provided as part of the product documentation and also accessible from the product’s user interface.
ja: これは通常、製品添付の文書に含めるとともに、製品のユーザー インターフェースからアクセスできるようにします。

source: It is very helpful and efficient to develop, maintain, and evolve checklists that cover the verification steps that the compliance team follows, both to ensure consistency and to ensure that no verification steps are overlooked.
ja: コンプライアンス チームが、一貫性を確認して、検証ステップが見落とされていないかを確認する時に従うチェックリストを、作成し維持し発展させるのは大変有益で効率的なことです。

source: It is vital to archive open source packages downloaded from the web in their original form.
ja: ウェブからダウンロードしたオープン ソース パッケージをオリジナル形式で保管しておくことは不可欠なことです。

source: It is your responsibility to resolve the issue with the inquirer, while being collaborative and showing good will.
ja: 協力的で誠意をもって照会者と一緒に課題を解決するのが、担当者の責任です。

source: It was very easy to know who was the provider for every software component.
ja: 全てのソフトウェア コンポーネントについて誰が提供者であるかを知るのは大変容易でした。

source: It will also be added to the software inventory that tracks open source use and use cases.
ja: ソフトウェア コンポーネントは、オープン ソース利用とユースケースを記録したソフトウェア一覧表に加えられます。

source: It’s a powerful approach that lets people work together to build great solutions while realizing shared benefits.”
ja: 偉大なソリューションを構築するために、人々を共に作業させるパワフルなアプローチです。そこからは実際にメリットが共有されます。」

source: It’s a powerful approach that lets people work together to build great solutions while realizing shared benefits.” Rob Alexander, CIO, Capital One
ja: 偉大なソリューションを構築するために、人々を共に作業させるパワフルなアプローチです。そこからは実際にメリットが共有されます。」 Rob Alexander, CIO, Capital One

source: It’s easy to forget subtasks or pending subissues, but doing so may lead to prematurely closing a compliance ticket even though open issues remain.
ja: サブタスクや保留中の小課題は簡単に忘れてしまいますが、そうすると、未解決の課題が残っている時でさえもコンプライアンス チケットをクローズするような未熟なプロセスに陥ってしまいます。

source: Kernel space versus user space
ja: カーネル空間とユーザー空間

source: Kernel space versus user space .
ja: カーネル空間とユーザー空間

source: Knowing this information, achieving incremental compliance becomes a relatively easy task:
ja: この情報を知ることで、インクリメンタル コンプライアンスの達成は、比較的容易なタスクになります。

source: Knowledge and experience in establishing corporate-wide policies and processes .
ja: 企業全体のポリシーとプロセスを確立できる知識と経験

source: Knowledge of community consensus and practices
ja: コミュニティのコンセンサスと慣行の知識

source: Knowledge of community consensus and practices .
ja: コミュニティのコンセンサスと慣行の知識

source: Known software components in use, also known as the software Bill of Materials (BoM) .
ja: 利用されている既知のソフトウェア コンポーネント、ソフトウェア構成リスト（BoM）として知られているもの

source: LEGAL
ja: 法務

source: LEGAL 53
ja: 法務 53

source: LESSONS LEARNED
ja: 得た教訓

source: LESSONS LEARNED In the past few years, we have witnessed several cases of non-compliance that made their way to the public eye.
ja: 得た教訓 この数年で明るみに出たコンプライアンス違反が数件ありました。

source: LESSONS LEARNED 28
ja: 得た教訓 28

source: LICENSE CLASSIFICATION
ja: ライセンス分類

source: LICENSE CLASSIFICATION 141
ja: ライセンス分類 141

source: LICENSE COMPATIBILITY MATRIX
ja: ライセンス両立性マトリックス

source: LICENSE COMPATIBILITY MATRIX 139
ja: ライセンス両立性マトリックス 139

source: LICENSE PLAYBOOKS
ja: ライセンス プレーブック

source: LICENSE PLAYBOOKS 138
ja: ライセンス プレーブック 138

source: LIGHTWEIGHT POLICIES AND PROCESSES
ja: ポリシーとプロセスの負荷の軽さ

source: LOCALIZATION
ja: ローカル化

source: LOCALIZATION 59
ja: ローカル化 59

source: Legal Representative
ja: 法務の代表者

source: Legal Review
ja: 法務レビュー

source: Legal Review In the legal review phase, the legal counsel (member of the OSRB) reviews reports generated by the scanning tool, the license information of the software component, and any comments left in the compliance ticket by engineers and members of the OSRB.
ja: 法務レビュー 法務レビュー フェーズでは、法務担当（OSRBメンバー）は、スキャン ツールによって生成された報告や、ソフトウェア コンポーネントのライセンス情報や、技術者やOSRBメンバーによってコンプライアンス チケットに記載されたコメントをレビューします。

source: Legal Review 81
ja: 法務レビュー 81

source: Legal Review Phase
ja: 法務レビュー

source: Legal Review Phase Input
ja: 法務レビュー フェーズ インプット

source: Legal Review Phase 85
ja: 法務レビュー フェーズ 85

source: Legal counsel attaches a license to this proprietary component, and forwards it to the compliance officer to perform architectural and linkage analysis.
ja: 法務担当は、ライセンスをこのプロプライエタリ コンポーネントに付与し、アーキテクチャー解析とリンク解析の実施のためにコンプライアンス オフィサーへ送ります。

source: Legal counsel will flag this and reassign the compliance ticket to engineering to remove the proprietary source code from the open source component.
ja: 法務担当は、この件にフラグを付けて、オープン ソース コンポーネントからプロプライエタリ ソース コードを取り除くために、コンプライアンス チケットを技術担当に割り当てます。

source: Legal examines the new audit report.
ja: 法務担当は、新しい監査報告を確認します。

source: Legal has approved the written offer notice and overall compliance documentation.
ja: 法務担当は、書面による申出とコンプライアンス文書全体を承認しています。

source: Legal opinion on compliance, and decision on incoming and outgoing licenses
ja: コンプライアンスに関する法務の意見、入るライセンスと出るライセンスに関する決定

source: Legal opinion on compliance, and decision on incoming and outgoing licenses .
ja: コンプライアンスに関する法務の意見、入るライセンスと出るライセンスに関する決定

source: License Compliance Problems
ja: ライセンスコンプライアンス問題

source: License Compliance Problems 24
ja: ライセンスコンプライアンス問題 24

source: License Playbooks: Easy-to-read, digest-form summaries of open source licenses intended for software developers .
ja: ライセンス プレーブック：ソフトウェア開発者を意図して書かれた、オープン ソース ライセンスについての簡単に読める要約形式のまとめ

source: License changes can occur between version upgrades.
ja: バージョン更新の間に、ライセンス変更が起きる可能性があります。

source: License classification: An easy way to understand the different licenses, and the course of action needed when using source code provided under these licenses
ja: ライセンス クラス：異なるライセンスと、これらのライセンスで許諾されたソース コードを利用する際に必要な行動を理解する簡単な方法

source: License compatibility challenges can arise when combining diverse open source software components, in source and/or object form, that are distributed under licenses with incompatible terms.
ja: ライセンス両立性に関する取り組みは、両立しない条件の下に頒布されている様々なオープン ソース ソフトウェア コンポーネントを、ソースやオブジェクト形式で結合する際に、生じます。

source: License compatibility is an area where development teams need detailed guidance from Legal Counsel and should never be left to draw their own conclusions.
ja: ライセンス両立性は、開発チームが法務担当からの詳細なガイドラインを必要とするもので、自分たちだけで結論を出すべきではない分野です。

source: License compatibility is the determination of whether a software component and its license are compatible with one or more other components and their licenses (i.e., that their licensing terms do not conflict).
ja: ライセンス両立性とは、ソフトウェア コンポーネントとそのライセンスが一つ以上の他のコンポーネントとそのライセンスと両立できるかどうか（ライセンスが矛盾を起こさないか）を決めることです。

source: License compatibility matrix: A grid to help determine whether License-A is compatible with License-B.
ja: ライセンス両立性マトリックス：ライセンスAがライセンスBと両立性があるか判断するのを助ける表

source: License compliance failures may result in any (or a combination) of the following:
ja: ライセンス コンプライアンス上の失敗は下記のいずれか（か、その組み合わせ）を招き得ます。

source: License compliance failures may result in any (or a combination) of the following: .
ja: ライセンスコンプライアンス上の失敗は下記のいずれか（か、その組み合わせ）を招き得ます。

source: License compliance problems are typically less damaging than intellectual property problems, as they don’t have the side effect of forcing you to release your proprietary source code under an open source license.
ja: ライセンスコンプライアンス問題は知財上の問題に比べ一般に損害は小さいです。自社のプロプラエタリなコードをオープンソース ライセンスで開示するといった副作用がないからです。

source: License conflicts to be verified by legal
ja: 法務担当によって検証されるべきライセンス矛盾

source: License conflicts to be verified by legal .
ja: 法務担当によって検証されるべきライセンス矛盾

source: License name and version
ja: ライセンス名とバージョン

source: License obligations that must be met when using open source components
ja: オープン ソース コンポーネントを利用する際に満足しなければならないライセンス義務

source: License playbooks are summaries of commonly used open source licenses.
ja: ライセンス プレーブックは、広く使われているオープン ソースについての要約です。

source: License playbooks minimize the number of basic questions sent to Legal Counsel and provide developers with immediate legal information about these licenses.
ja: ライセンス プレーブックは、法務担当へ来る基本的な質問の数を最小化し、これらのライセンスに関する法務的な情報を即座に開発者に提供します。

source: License website URL
ja: ライセンス ウェブサイトURL

source: Licenses Requiring Legal Counsel Approval
ja: 法務担当による承認を必要とするライセンス

source: Licenses Requiring Manager Approval
ja: マネージャ承認を必要とするライセンス

source: Licenses in effect, license texts and summary of obligations .
ja: 影響があるライセンス、ライセンス文、義務の要約

source: Linkage Analysis Review
ja: リンク解析レビュー

source: Linkage Analysis Review The goal of a linkage analysis review is to find potentially problematic code combinations at the static and dynamic link level, such as linking a GPL or more commonly an LGPL-licensed library to a proprietary source code component.
ja: リンク解析レビュー リンク解析の目的は、動的および静的リンク レベルで、GPL ライブラリをプロプライエタリ ソース コード コンポーネントにリンクしているなど、問題発生の可能性のあるコードの組み合わせ を検出することです。

source: Linkage Analysis Tool
ja: リンク解析ツール

source: Linkage Analysis Tool 119
ja: リンク解析ツール 119

source: Linkage analysis tools
ja: リンク解析ツール

source: Linkage conflicts are reported to Engineering to resolve.
ja: リンク問題は、解決するように技術担当に報告されます。

source: Linking of open source into proprietary source code (or vice versa - specific to C/C++ source code)
ja: オープンソースをプロプラエタリなソースコードのソフトウェアにリンク (またはその逆。C/C++特有の問題)

source: Linking of open source into proprietary source code (or vice versa - specific to C/C++ source code) Occurs as a result of linking software components that have conflicting or incompatible licenses
ja: オープンソースのソフトウェアをプロプラエタリなソースコードのソフトウェアにリンク (またはその逆。C/C++特有の問題) specific to C/C++ source code)衝突(conflict)する、または互換性のない(incompatible)[03] ライセンスのソフトウェアコンポーネントをリンクした結果発生

source: Linking of open source into proprietary source code (or vice versa .
ja: オープンソースのソフトウェアをプロプラエタリなソースコードのソフトウェアにリンク (またはその逆。C/C++特有の問題)

source: Linking open source components into proprietary or third-party source code or vice versa
ja: オープン ソース コンポーネントをプロプライエタリやサード パーティ ソース コードにリンク、またはその逆。

source: Linking open source components into proprietary or third-party source code or vice versa .
ja: オープン ソース コンポーネントをプロプライエタリやサード パーティ ソース コードにリンク、またはその逆。.

source: Localization
ja: ローカル化

source: Localization Translate basic information in target languages about open source information related to the product or software stack
ja: ローカル化 製品やソフトウェアスタックに関わるオープンソースについて、基本的情報をターゲットとなる言語に翻訳

source: Location of the software in the SCMS
ja: SCMSでのソフトウェアの位置

source: Long-Term Goals versus Short-Term Execution
ja: 長期的な目標と短期的な実行

source: Long-Term Goals versus Short-Term Execution Figure 4 described the essential elements needed for a successful compliance program.
ja: 長期的な目標と短期的な実行 図4はコンプライアンスプログラムの成功に必須の構成要素を示しています。

source: Long-Term Goals versus Short-Term Execution 39
ja: 長期的な目標と短期的な実行 39

source: MANAGING COMPLIANCE INQUIRIES
ja: コンプライアンスに関する照会の管理

source: MANDATE BASIC RULES
ja: 基本ルールを強制

source: MEASUREMENT AND ANALYSIS
ja: 計測と分析

source: MESSAGING
ja: 意思伝達

source: MESSAGING 126
ja: 意思伝達 126

source: Maintain records of compliance: OSRB is responsible for ensuring that all compliance records for any given open source software component are up to date.
ja: コンプライアンスの記録を取る：いかなるオープンソース ソフトウェア コンポーネントについてもコンプライアンスに関するすべての記録が最新のものとなっていることにOSDBは責任を持ちます。

source: Maintaining Compliance
ja: コンプライアンスの維持

source: Maintaining Compliance 42
ja: コンプライアンスの維持 42

source: Maintaining compliance is a continuous effort that depends on discipline and commitment to build compliance activities into existing engineering and business processes.
ja: コンプライアンスの維持は継続的な努力であり、規律、そして既存の製造およびビジネスのプロセスへのコンプライアンス活動組み込みのコミットメントによります。

source: Maintaining open source compliance activities is an ongoing challenge as the organization grows and ships more products and services using open source software.
ja: オープンソースのコンプライアンス活動を維持するのは組織 が成長し、オープンソースを使った更なる製品やサービス出荷に伴う進行中の挑戦です。

source: Major Source Code Changes
ja: 大きなソース コード変更

source: Make available the source code including any modifications applied to it (specific to the GPL/LGPL family of licenses).
ja: ソースコードをすべての改変と共に利用可能 に（GPL/LGPLファミリのライセンスに限る）

source: Making inappropriate or misleading statements in the product documentation or product advertisement material.
ja: 不十分な、あるいは誤解を招く主張

source: Making source code available (including the modifications) is one of the requirements of the GPL/LGPL family of licenses.
ja: ソースコードを利用可能とすること（変更を含む）はGPL/LGPLライセンスファミリーの要求の一つです。

source: Manager approval is required for components distributed under these licenses, since in addition to notices fulfillment (publishing license text, attribution notice, copyright notice, etc.), you have the obligation to release any source code modifications.
ja: 通知に関する義務（ライセンス文、帰属通知、著作権通知などの表記）に加えて、ソース コード変更を開示する義務があるので、これらのライセンスで許諾されたコンポーネントでは、マネージャによる承認が要求されます。

source: Mandate architecture reviews and code inspections for the Open Source Review Board (OSRB) to understand how software components are interrelated and to discover license obligations that can propagate from open source to proprietary software.
ja: アーキテクチャのレビューとコードの検査を指示し、オープンソース評価委員会 (OSRB) がソフトウェアコンポーネント間の関係を理解し、オープンソースからプロプラエタリなソフトウェアへとライセンス上の義務が伝搬していることを見つけられるようにします。

source: Mandate that developers file approval requests early, even if they didn’t yet decide on adoption of OS code
ja: 開発者がオープンソースの利用申請を早期に、オープンソースのコード の利用を決める前でも行うよう命令

source: Mandate third party software providers to disclose open source in licensed or purchased software components
ja: サードパーティ プロバイダからライセンスされた、または購入したソフトウェア コンポーネントに含まれるオープンソースの情報の開示をサードパーティ プロバイダに指示

source: Mandating engineers to take your internal open source compliance training
ja: 組織内のオープン ソース コンプライアンスに関するトレーニングを技術者が受けるように義務付けます。

source: Many tools can prove very useful in an open source compliance program:
ja: 多くのツールは、オープン ソース コンプライアンス プログラムの中で、とても有用であることを証明しています。
